export const engToUkrMap = {
  'q': 'й', 'w': 'ц', 'e': 'у', 'r': 'к', 't': 'е',
  'y': 'н', 'u': 'г', 'i': 'ш', 'o': 'щ', 'p': 'з',
  '[': 'х', ']': 'ї',

  'a': 'ф', 's': 'і', 'd': 'в', 'f': 'а', 'g': 'п',
  'h': 'р', 'j': 'о', 'k': 'л', 'l': 'д', ';': 'ж', "'": 'є',

  'z': 'я', 'x': 'ч', 'c': 'с', 'v': 'м', 'b': 'и',
  'n': 'т', 'm': 'ь', ',': 'б', '.': 'ю', '/': '.',

  '`': 'ʼ', ' ': ' '
};

export const enToUkMap = {
  'q': 'й', 'w': 'ц', 'e': 'у', 'r': 'к', 't': 'е',
  'y': 'н', 'u': 'г', 'i': 'ш', 'o': 'щ', 'p': 'з',
  '[': 'х', ']': 'ї', 'a': 'ф', 's': 'і', 'd': 'в',
  'f': 'а', 'g': 'п', 'h': 'р', 'j': 'о', 'k': 'л',
  'l': 'д', ';': 'ж', "'": 'є', 'z': 'я', 'x': 'ч',
  'c': 'с', 'v': 'м', 'b': 'и', 'n': 'т', 'm': 'ь',
  ',': 'б', '.': 'ю', '/': '.', '`': 'ʼ'
};

export const ukToEnMap = Object.fromEntries(
  Object.entries(enToUkMap).map(([en, uk]) => [uk, en])
);
